fullCylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          340;
        startFace       39660;
    }
    outlet
    {
        type            patch;
        nFaces          340;
        startFace       40000;
    }
    wallDiffuser
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1600;
        startFace       40340;
    }
)

// ************************************************************************* //
