fullCylinder/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [1 -1 -2 0 0 0 0];

internalField       uniform 100000;

boundaryField
{
    "walls"
    {
        type               fixedFluxPressure;
        value              $internalField;
    }
  
    "outlet"
    {
        type            prghPressure;
        p               $internalField;
        value           $internalField;

    }

    "inlet"
    {
        type             fixedFluxPressure;
        value              $internalField;
    }

 //   "symm.*"
 //   {
//        type symmetryPlane;
//        type empty;
 //   }
}


}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
