fullCylinder/system/sampleLine
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.

\*---------------------------------------------------------------------------*/

start (2.5e-06 0 2.5e-06);
end   (2.5e-06 5e-05 2.5e-06);
fields (alpha.particles U.particles);

// Sampling and I/O settings
//#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

interpolationScheme cellPoint;

setFormat   raw;

// Override settings here, e.g.
setConfig
{
    type lineUniform;
    axis x;        // y, z, xyz
    nPoints 30;
}


// Must be last entry
#includeEtc "caseDicts/postProcessing/graphs/graph.cfg"

// ************************************************************************* //
